import type { Teacher } from "~/types/teacher";

export const teacherData: Teacher = {
    name: "谭作文",
    role: "社团指导老师",
    title: "江财网络空间安全专业负责人、教授、博导",
    bio: "江西财经大学计算机与人工智能学院教授，博士研究生导师。研究兴趣是密码学、隐私保护和区块链安全等。现任国家自然科学基金通信评审专家、中国数学会计算机数学专业委员会委员、中国中文信息学会大数据安全与隐私计算专业委员会委员、教育部高等学校数学类专业教学委员会“全国高校密码挑战赛”组织委员会委员、中国数学会会员、中国密码学会高级会员、中科院抚州数据研究院特聘教授。",
    highlights: [
        "入选斯坦福全球前2%顶尖科学家“终身科学影响力榜单” (2024, 2025)",
        "主持国家自然科学基金项目5项，省重点自然科学基金等省部级项目10余项",
        "在权威学术期刊和信息安全国际会议上发表论文100余篇",
        "曾任中国科学院数学与系统科学研究院访问学者、瑞典Uppsala大学信息技术系访问教授"
    ],
    link: "http://cta.jxufe.edu.cn/home/teacherInfo/detail?fid=109051&uid=121895575",
    // avatar: "" 
};
